{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":["^Officer: Lucas, you have a visitor. He's called Shade.","\n","^Shade: I'm going to try and help you get away free catching the actual culprit, but for that I will need your help.","\n","^Lucas: I'm gonna be caught aren't I? I'm the culprit, just give me the death sentence, please...","\n","^Shade: I don't believe you're the culprit, Lucas. There's more to this than you're letting on. Why don't you tell me what really happened?","\n","^Lucas: I wanted to meet her that night, but as I got to the door a text from Evelyn pops up saying she has Marina coming over and asked me to meet her at our usual spot the next day. So I left only to return the next day with a bouquet of flowers, then I find her dead... I called the police and then they threw me in here.","\n",{"->":"choices"},{"#f":1}],"choices":[[["ev",{"^->":"choices.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^You said you called the police when you found her. How long did it take you to contact them after finding her body?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Did you check her phone or anything around the studio when you found her? Any signs of a struggle or someone else being there?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^You mentioned Evelyn asked you to meet her at the usual spot the next day. Can you tell me more about that spot?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":"option_2"},"/ev",{"*":".^.^.c-3","flg":19},{"s":["^Did you see Victor at all around the time of Evelyn's death?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^How was your relationship with Marina? You mentioned her coming over to the studio the night Evelyn died.",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.5.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-5","flg":18},{"s":["^I guess that covers it...",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"choices.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"option_1"},{"#f":5}],"c-1":["ev",{"^->":"choices.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"option_2"},{"#f":5}],"c-2":["ev",{"^->":"choices.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"option_3"},{"#f":5}],"c-3":["ev",{"^->":"choices.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"option_4"},{"#f":5}],"c-4":["ev",{"^->":"choices.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n",{"->":"option_5"},{"#f":5}],"c-5":["ev",{"^->":"choices.0.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.5.s"},[{"#n":"$r2"}],"\n","end",{"#f":5}]}],{"#f":1}],"option_1":[["^Lucas: It took me around 10 minutes after finding the body to contact the police.","\n","^Shade: 10 minutes? Why's that?","\n","^Lucas: I was overwhelmed at the sight of the love of my life's cold body. It took me a while to stop crying and get myself together.","\n","^Shade: Love of your life?","\n","ev",true,"/ev",{"VAR=":"mood","re":true},"ev","str","^don't show diary","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^show diary","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"choices"},{"#f":5}],"c-1":["\n","^Lucas: What man, is that how she thought of me??! If that's the case, why did she even bother trying to date me again now?","\n","^Shade: Maybe she feels differently about you now, you've changed right? If she didn't like you why would she even consider dating you?","\n","^(this outta calm him down)","\n","^Lucas: Yeah, man... we were starting fresh. I swear, what we had... it was real. It was always real.","\n",{"->":"choices"},{"#f":5}]}],{"#f":1}],"option_2":["^Lucas: No, man... everything seemed like it always was. The studio was clean, no signs of a struggle. It felt... normal, y'know? Evelyn was probably working late considering Marina was gonna come, so nothing about that felt off. As for the phone, I didn't check it.","\n","^Shade: Victor Blake? Her brother?","\n","^Lucas: Yeah, him. He always acted like the know-it-all genius with the money, the fame, everything anyone could want. You'd think he'd be supportive of Evelyn, right? But then there was all this stuff about her will... He started arguing about it.","\n","^Shade: Victor...","\n",{"->":"choices"},{"#f":1}],"option_3":["^Lucas: Yeah, it's this little café we always went to when things got tough. It's where we started dating, you know? It's kinda our place y'know...","\n","^Shade: And what happened when you showed up the next day?","\n","^Lucas: I just... stood there. I brought her flowers, but when I got to her studio, everything felt wrong. She wasn't there. That's when I found her...","\n",{"->":"choices"},{"#f":1}],"option_4":["^Lucas: No, but I know he's been around a lot lately. He and Evelyn were in contact about the company. She didn't like the pressure he put on her, but she did it because she wanted to make sure the family business would star afloat. I heard them arguing a couple of days before... about her art, about her will...","\n","^Shade: Do you know where I can find him?","\n","^Lucas: I'll give you and address to his office.","\n",{"->":"choices"},{"#f":1}],"option_5":["^Lucas: Marina? She... she was always around. Always pushing Evelyn to do more. I couldn't understand it. I mean, I get that she wanted Evelyn to succeed, but sometimes it felt like she just wanted to use her for the money. And, you know, Evelyn... she just wanted to create. It wasn't about the money for her.","\n","^Shade: So you didn't trust Marina?","\n","^Lucas: I did, but no really. She pushed Evelyn too hard, made everything about business. She didn't care if it made Evelyn unhappy, as long as she got what she wanted.","\n","^Shade: Where can I find Marina? Do you know where she lives?","\n","^Lucas: No, not really. I didn't speak with her much after my breakup. No one knows about me and Evelyn getting back to be honest.","\n",{"->":"choices"},{"#f":1}],"global decl":["ev",false,{"VAR=":"mood"},"/ev","end",null],"#f":1}],"listDefs":{}}