{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":["^Officer: Lucas, you have a visitor. He's called Shade.","\n","^Shade: I'm here to help you, Lucas. I want to find the real culprit, but I'll need your cooperation.","\n","^Lucas: Help me? There's no point, is there? I'm the culprit... I have to be! Just give me the death sentence and end it already...","\n","^Shade: I don't believe you did it, Lucas. There's more to this story. Help me understand--tell me what really happened.","\n","^Lucas: Fine. You want the truth? I... I wanted to see her that night. But as  Igot to the door, she texted me--said Marina was coming over and to meet her at our usual spot tomorrow. So, I left. The next day, I came back with flowers... and that's when I found her.","\n","^Lucas: I called the cops... and they just threw me in here.","\n",{"->":"choices"},{"#f":1}],"choices":[["ev","str","^Shade","/str","/ev",{"VAR=":"speaker","re":true},["ev",{"^->":"choices.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^This must be hard. Can you tell me what Evelyn was like?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":"option_1"},"/ev",{"*":".^.^.c-1","flg":19},{"s":["^You said you called the police when you found her. How long did it take?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":"option_1"},"/ev",{"*":".^.^.c-2","flg":19},{"s":["^Did you check her phone or notice anything odd in the studio?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":"option_1"},"/ev",{"*":".^.^.c-3","flg":19},{"s":["^You mentioned meeting at your usual spot. Can you tell me about it?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":"option_2"},"/ev",{"*":".^.^.c-4","flg":19},{"s":["^Did you see Victor around the time of Evelyn's death?",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str",{"CNT?":"option_1"},"/ev",{"*":".^.^.c-5","flg":19},{"s":["^How was your relationship with Marina? You mentioned her being at the studio.",{"->":"$r","var":true},null]}],["ev",{"^->":"choices.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-6","flg":18},{"s":["^I guess that covers it...",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"choices.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n",{"->":"option_1"},{"#f":5}],"c-1":["ev",{"^->":"choices.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":"option_2"},{"#f":5}],"c-2":["ev",{"^->":"choices.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":"option_3"},{"#f":5}],"c-3":["ev",{"^->":"choices.0.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n",{"->":"option_4"},{"#f":5}],"c-4":["ev",{"^->":"choices.0.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n",{"->":"option_5"},{"#f":5}],"c-5":["ev",{"^->":"choices.0.c-5.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n",{"->":"option_6"},{"#f":5}],"c-6":["ev",{"^->":"choices.0.c-6.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n","end",{"#f":5}]}],{"#f":1}],"option_1":["^Lucas: Evelyn... she was... different, y'know? Like, kinda cryptic? Everything she did had this... meaning, or a puzzle behind it. She was so into those. Her lock screen? Password hidden in some riddle. Every gift? Like, you'd need a treasure map to find it.","\n","^Shade: Sounds like she loved puzzles.","\n","^Lucas: Yeah... that's one way to put it. She kept you guessing. Always.","\n",{"->":"choices"},{"#f":1}],"option_2":[["^Lucas: Uh... maybe like, ten minutes? Or so?","\n","^Shade: Ten minutes? Why the delay?","\n","^Lucas: I... I was a wreck, man! The love of my life... just lying there, cold and lifeless. You htink I could just ... dial the cops like that? It took everythin in me to even move.","\n","^Shade: The love of your life?","\n","ev","str","^don't show diary","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^show diary","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"choices"},{"#f":5}],"c-1":["\n","^Lucas: What... what is this? Is that how she really felt? If that's true, why did she even bother getting back with me?!","\n","^Shade: Maybe she changed her mind, Lucas. People grow, and maybe she saw something in you. You have changed, haven't you?","\n","^Lucas: Yeah... yeah, maybe. We were starting fresh. What we had... it was real. I swear it was real.","\n",{"->":"choices"},{"#f":5}]}],{"#f":1}],"option_3":["^Lucas: No, man... I couldn't. I was just... frozen, y'know? The whole place looked... normal. Too normal,  even. Like she'd just been working late, waiting for Marina to show up.","\n","^Shade: Nothing at all seemed out of place?","\n","^Lucas: Well... okay, there was one thing. Victor.","\n","^Shade: Victor? Her brother?","\n","^Lucas: Yeah. He was around a lot recently. He and Evelyn were always arguing about something--her art, the company, or the damn will. I know they'd fought a couple of days before. She was stressed out, and Victor didn't care. He just kept pushing her.","\n","^Shade: What do you think he wanted?","\n","^Lucas: Control, maybe? That's his thing, y'know? Getting what he wants, no matter who gets hurt. But I didn't see him there when I found her. It's just... something doesn't sit right.","\n","^Shade: What about her phone?","\n","^Lucas: I didn't... I just... couldn't.","\n",{"->":"choices"},{"#f":1}],"option_4":["^Lucas: Yeah... it's this little café we'd go to. Kinda like... our place. First dates, tough days, everything. That's where we'd always go.","\n","^Shade: What happened when you showed up?","\n","^Lucas: I... I brought flowers. But when I got to her studio, something felt... wrong. She wasn't there. And then... I found her.","\n",{"->":"choices"},{"#f":1}],"option_5":["^Lucas: No. But he was around a lot lately. Always in her ear about the company. She didn't like it--he pushed her too much. They fought a couple days before... about her art. And her will.","\n","^Shade: Do you thing Victor was involved?","\n","^Lucas: I don't know... Maybe. He's the type to get what he wants, no matter who he steps on. But... I don't know for sure.","\n","^Shade: Where can I find him?","\n","^Lucas: His office. Here--take the address.","\n",{"->":"choices"},{"#f":1}],"option_6":["^Lucas: Marina... she was... complicated. Always pushing Evelyn. 'Do more! Make money!' Like, she cared more about the business than Evelyn's happiness.","\n","^Shade: So, you don't trust her?","\n","^Lucas: I did... but not really. She cared about Evelyn's career, sure. But Evelyn? The person? Not so much.","\n","^Shade: Do you know where Marina lives?","\n","^Lucas: No idea. We weren't exactly close after Evelyn and I broke up. And no one knew we got back together either.","\n",{"->":"choices"},{"#f":1}],"global decl":["ev","str","^Narrator","/str",{"VAR=":"speaker"},"/ev","end",null],"#f":1}],"listDefs":{}}