{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":["^Marina: Who the hell are you?","\n","^Shade: Detective Shade. I'm investigating Evelyn Blake's murder.","\n","^Marina: Detectives, always so good at breaking and entering. Did the academy teach you to ignore doorbells, or is this a personal flair?","\n","^Shade: The door was unlocked, and you didn't respond. I was concerned.","\n","^Marina: Concerned? Maybe start by locking the door on your way out next time. Now, make it quick. I don't have time for your games.","\n","^Shade: I'm just here to ask a few questions.","\n","^Marina: Questions. Of course. Because digging up non-existant dirt on me and Victor is a productive use of your time.","\n","^Shade: You mentioned Victor--","\n","^Marina: Yes, Victor. We're both trying to keep it together after Evelyn's death, and you poking around isn't helping. So, what is it this time?","\n",{"->":"choices_a"},{"#f":1}],"choices_a":[["ev","str","^Shade","/str","/ev",{"VAR=":"speaker","re":true},"ev","str","^Relation with Evelyn","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Business Ventures","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"option_a1"},{"#f":5}],"c-1":["\n",{"->":"option_a2"},{"#f":5}]}],{"#f":1}],"option_a1":["^Shade: Tell me about your relationship with Evelyn. You two worked closesly together, didn't you?","\n","^Marina: We were business partners. She handled the art, I handled the logistics. It was a good balance. Not that it mattered in the end.","\n",{"->":"transition"},{"#f":1}],"option_a2":["^Shade: What kind of buisness ventures were you and Evelyn planning?","\n","^Marina: Plenty. Evelyn was talented, and I made sure the world saw it. That's what partners do. But now you're here, turning all that into a spectacle.","\n",{"->":"transition"},{"#f":1}],"transition":["^Marina: Enough. I'm not answering more of your prying questions. You're wasting my time and energy. Get to the point or get out.","\n","^Shade: Your apartment is striking. Mind if I take a quick photo for reference?","\n",{"->":"choices_b"},{"#f":1}],"choices_b":[["ev","str","^Shade","/str","/ev",{"VAR=":"speaker","re":true},"ev","str","^Convince with Professionalism","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Appeal to Her Ego","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Push Back Against Her Defensiveness","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Drop the Request","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"option_b1"},{"#f":5}],"c-1":["\n",{"->":"option_b2"},{"#f":5}],"c-2":["\n",{"->":"option_b3"},{"#f":5}],"c-3":["\n",{"->":"option_b4"},{"#f":5}]}],{"#f":1}],"option_b1":["^Shade: This isn't about invading your privacy, Marina. Sometimes photos help me see details I might miss in the moment. It's purely for the investigation.","\n","^Marina: You're persistent, I'll give you that. Fine. But don't touch anything--or I'll have you arrested for real.","\n","end",{"#f":1}],"option_b2":["^Shade: You've done an incredible job with this place. It shows you've got an eye for detail--Evelyn must've seen that too. A quick photo could help me piece things together.","\n","^Marina: Flattery gets you one shot, Detective. Don't push your luck.","\n","end",{"#f":1}],"option_b3":["^Shade: Marina, if you have nothing to hide, then a photo shouldn't be an issue. Or are you worried about what it might reveal?","\n","^Marina: You're unbelievable. Fine. But take your damn photo and leave.","\n","end",{"#f":1}],"option_b4":["^Shade: You're right. I don't want to intrude further. I'll respect your space.","\n","^Marina: Good. Now respect my time too, Detective, and get out.","\n","end",{"#f":1}],"global decl":["ev","str","^Narrator","/str",{"VAR=":"speaker"},"/ev","end",null],"#f":1}],"listDefs":{}}