{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":["^Shade: Let's not waste time. Evelyn Blake didn't die by accident. This was a carefully planned crime, and one of you orchestrated it. By the end of this, I'll expose who.","\n","^Victor: I'm here out of courtesy, Detective. I trust you'll wrap this up quickly.","\n","^Marina: Same here. If you're going to waste our time, at least try to be interesting.","\n","^Lucas: I didn't do anything! Why am I even here? Evelyn was my everything. I could never hurt her!","\n","^Shade: Everyone at this table had a motive. You all wanted something from Evelyn, but only two of you decided to take her life. Let's piece this together.","\n",{"->":"branches"},{"#f":1}],"branches":[["ev","str","^Shade","/str","/ev",{"VAR=":"speaker","re":true},"ev","str","^Victor's financial motives","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Marina's suspicious behavior","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Lucas' alibi","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Push further","/str",{"CNT?":"victor_branch"},{"CNT?":"marina_branch"},"&&",{"CNT?":"lucas_branch"},"&&","/ev",{"*":".^.c-3","flg":21},{"c-0":["\n",{"->":"victor_branch"},{"#f":5}],"c-1":["\n",{"->":"marina_branch"},{"#f":5}],"c-2":["\n",{"->":"lucas_branch"},{"#f":5}],"c-3":["\n",{"->":"push_further"},{"#f":5}]}],{"#f":1}],"victor_branch":["ev",{"VAR?":"spoken_to_first"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Shade: Victor, let's start with you.","\n","ev",true,"/ev",{"VAR=":"spoken_to_first","re":true},{"->":".^.^.^.5"},null]}],"nop","\n","^Shade: Evelyn changed her will, leaving her estate to you instead of charity. That alone is suspicious, but add your shredded documents, and it's clear you had something to hide.","\n","^Victor: Evelyn's decision was her own. I simply helped her see the practicality of keeping her assets in the family. That's not a crime, is it?","\n","^Shade: But it wasn't practicality, was it? It was desperation. Your finanical transactions show deals that were dependant on you gaining control of Evelyn's art. She refused to sell out, so you made sure she wouldn't have a choice.","\n","^Victor: Detective, if you have proof of your accusations, I'd love to see it.","\n",{"->":"branches"},{"#f":1}],"marina_branch":["ev",{"VAR?":"spoken_to_first"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Shade: Marina, let's start with you.","\n","ev",true,"/ev",{"VAR=":"spoken_to_first","re":true},{"->":".^.^.^.5"},null]}],"nop","\n","^Shade: Marina, Evelyn's phone was found in your locked compartment. Care to explain why?","\n","^Marina: She left it at my place during one of our meetings. I meant to return it, but then... well, you know what happened.","\n","^Shade: Strange, considering Evelyn texted Lucas the night of her death. Are you saying she somehow managed that without her phone?","\n","^Marina: Are you seriously suggesting I had something to do with her death? Victor and I were trying to protect her legacy, unlike some people.","\n",{"->":"branches"},{"#f":1}],"lucas_branch":["ev",{"VAR?":"spoken_to_first"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Shade: Lucas, let's start with you.","\n","ev",true,"/ev",{"VAR=":"spoken_to_first","re":true},{"->":".^.^.^.5"},null]}],"nop","\n","^Shade: Lucas, your alibi was shaky at best. Witnesses saw you near the studio after midnight.","\n","^Lucas: I didn't kill her! I went back because I was worried about her. I saw the light on and thought something was wrong, but when I got there, she was already--","\n","^Shade: Dead? Or drugged and unconscious, waiting for Victor to finish the job?","\n","^Lucas: I don't know! I didn't stay long. I couldn't handle it!","\n",{"->":"branches"},{"#f":1}],"push_further":[["ev","str","^Victor's shredded documents","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Marina's receipts for wine and pills","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Lucas' emotional reaction","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Finish this","/str",{"CNT?":"victor_push"},{"CNT?":"marina_push"},"&&",{"CNT?":"lucas_push"},"&&","/ev",{"*":".^.c-3","flg":21},{"c-0":["\n",{"->":"victor_push"},{"#f":5}],"c-1":["\n",{"->":"marina_push"},{"#f":5}],"c-2":["\n",{"->":"lucas_push"},{"#f":5}],"c-3":["\n",{"->":"turnabout"},{"#f":5}]}],{"#f":1}],"victor_push":["^Shade: Victor, the shredded documents in your office mentioned Marina and Evelyn's estate. You two planned this together, didn't you?","\n","^Victor: Planning? No. Discussing logistics? Perhaps. Evelyn's art was the cornerstone of our efforts to save the company. That required coordination.","\n","^Shade: Coordination to kill her? Marina provided the pills, you provided the motive, and together you silenced Evelyn when she refused to comply.","\n","^Victor: Bold accusation. Got proof?","\n",{"->":"push_further"},{"#f":1}],"marina_push":["^Shade: Marina, the receipts for wine and sleeping pills point directly to you. You drugged Evelyn to make her vulnerable. Care to deny it?","\n","^Marina: You're twisting everything! I gave her pills because she couldn't sleep. The wine was for a celebration we'd planned. I didn't kill her!","\n","^Shade: But you knew what Victor planned. You helped him set her up and clean the scene afterwards.","\n","^Marina: Stop putting words in my mouth.","\n",{"->":"push_further"},{"#f":1}],"lucas_push":["^Shade: Lucas, your reaction tells me you're hiding something. What aren't you saying?","\n","^Lucas: I loved her! But I knew something was wrong. Victor kept pushing her, and Marina was always in her ear. I should've done more to protect her!","\n","^Shade: But you didn't. You were too afraid of what they'd do, weren't you?","\n",{"->":"push_further"},{"#f":1}],"turnabout":["^Shade: Here's how it happened. Marina drugged Evelyn under the guise of helping her relax. Victor showed up later to confront Evelyn about the will and the company's future. When she still refused, he killed her--using Marina's setup to stage the scene, and later they cleaned it out.","\n","^Marina: I didn't want her dead! Victor said it was just to scare her into compliance. He lied to me!","\n","^Victor: You were complicit, Marina. Don't play the victim now.","\n","^Shade: Enough! Victor Blake, you're under arrest for the murder of Evelyn Blake. Marina Thorne, you're under arrest as an accomplice.","\n",{"->":"end"},{"#f":1}],"end":["^Victor: You'll regret this, Shade.","\n","^Marina: I didn't mean for this to happen!","\n","^Lucas: Evelyn deserved better. Thank you for finding the truth.","\n","end",{"#f":1}],"global decl":["ev","str","^Narrator","/str",{"VAR=":"speaker"},false,{"VAR=":"spoken_to_first"},"str","^normal","/str",{"VAR=":"mood"},"/ev","end",null],"#f":1}],"listDefs":{}}